namespace Library
{
    public static class SampleData
    {
        public static string[] AuthorNames = new string[]
        {
            "Толстой Лев Николаевич",
            "Иван Александрович Гончаров",
            "Михаил Юрьевич Лермонтов",
            "Николай Алексеевич Некрасов",
            "Федор Михайлович Достоевский",
            "Булгаков Михаил Афанасьевич",
            "Антон Павлович Чехов",
            "Толкин Джон Рональд Руэл",
            "Джордж Оруэлл",
            "Джоан Роулинг"
        };

        public static string[] BookNames = new string[]
        {
            "Властелин колец",
            "Гарри Поттер и Кубок огня",
            "1984",
            "Война и мир",
            "Алиса в Стране чудес",
            "Сто лет одиночества",
            "Чарли и шоколадная фабрика",
            "Дюна",
            "Скотный двор",
            "О мышах и людях",
            "Парфюмер",
            "Женщина в белом",
            "О дивный новый мир",
            "Крёстный отец",
            "Алхимик",
            "Дракула",
            "Мэр Кэстербриджа",
            "Сёгун",
            "Мастер и Маргарита",
            "Вещие сестрички"
        };

        public static string[] Publishers = new string[]
        {
            "Альпина Паблишер",
            "Издательский дом Питер",
            "Издательская группа АСТ",
            "Попурри",
            "Диалектика-Вильямс",
            "Издательство Весь",
            "Ювента",
            "Фламинго",
            "Эксмо",
            "Росмэн"
        };
    }
}
